{
  "version": 1,
  "blocks": [
    {
      "blockId": "3e1b5880-a2fc-4197-a506-8d7dab598f5b",
      "content": "<p>Cora checked her dress, took a last look at her invitation, sighed, and walked to the right door. The rumor on the street was that the House of Pleasures was a place with strong magic. When Cora touched the knocker, she could tell the rumors were true. She felt a little tingle of energy.</p>\n<p>As the door opened and Cora entered the lavish hall, she felt more than a tingle. A warm, sensual feeling lingered in the air. It was very different from mundane things everyone could do, like producing little wisps of light or making sure you couldn&rsquo;t lose your reading glasses. Cora would never even dream she&rsquo;d merit an invitation to a place like this.</p>\n<p>The doorman took her to a lavishly decorated room where Madame herself welcomed Cora to the House of Pleasures. She was a prestigious woman with witty eyes. Her expression made Cora feel like Madame knew more about her than anyone else.</p>\n<p>&ldquo;I&rsquo;m glad you decided to be our guest, dear Cora,&rdquo; Madame said with a warm smile. &ldquo;We are honored to have you .&rdquo;</p>\n<p>&ldquo;I&rsquo;m honored you invited me,&rdquo; Cora whispered. A servant appeared behind the dark velvet curtains. He or she was such a beautiful creature that Cora gasped.</p>\n<p>Micah had long, willowy hair that looked like silk. They served refreshments and smiled at Cora. Cora noticed intricate markings on Micah&rsquo;s skin. Micah winked at Cora, and the markings did a little dance.</p>\n<p>&ldquo;Thank you, dear Micah,&rdquo; Madame said and gestured to Cora to help herself to the fruit drinks and delicious treats. Cora chose a drink.</p>\n<p>&ldquo;Micah is a rare creature. I&rsquo;m so lucky that they serve us,&rdquo; Madame said and sipped her drink. She eyed Cora for a moment or two. When she spoke, her words were gentle and powerful at the same time. &ldquo;Now. Please tell me what brings you here.&rdquo;</p>\n<p>Cora hesitated for a moment before she answered. &ldquo;I&rsquo;ve lost my pleasure.&rdquo; She could feel the blush creeping on her cheeks. She drank from her glass and added: &ldquo;I lost my pleasure a long time ago, and I can&rsquo;t seem to attract a partner.&rdquo;</p>\n<p>&ldquo;You&rsquo;ve attracted us,&rdquo; Madame said. Her gaze pierced Cora, not hurting, but searching. Suddenly, Cora was relieved she had told the truth.</p>\n<p>&ldquo;Adoration,&rdquo; Madame finally said.</p>\n<p>&ldquo;I&rsquo;m sorry?&rdquo;</p>\n<p>&ldquo;You need adoration. For someone to tell you, and show you how unique you are.&rdquo; She clapped her hands, and Micah appeared again. Madame told them something in a low voice. She stood up and asked Cora to follow her. They went to a marble hall with many doors.</p>\n<p>&ldquo;I&rsquo;ll give you two choices today,&rdquo; Madame said. &ldquo;They&rsquo;ll provide different experiences, but your pleasure is always guaranteed.&rdquo;</p>\n<p>She gestured towards the doors. &ldquo;Behind the green door, you&rsquo;ll find the twins, Victor and Victoria. They are experts in the use of toys and their quick tongues. I&rsquo;ll tell you this: The twins do not ask questions. If you enter the green door, you give yourself into their capable hands.&rdquo;</p>\n<p>&ldquo;Behind the blue door, you&rsquo;ll find Ores. His body is his tool, and all his attention is yours. He&rsquo;s excellent at reading what you need, what you crave. Once you&rsquo;ve chosen, I&rsquo;ll open the door for you.&rdquo;</p>",
      "choseOne": {
        "target": "0b79333b-48c7-4576-b0e2-8fa03c5ce401",
        "text": "“I’ll go through the green door, to Victor and Victoria.”"
      },
      "choseTwo": {
        "target": "f52ea4a7-41c2-49f0-a1d7-77ff945a81c7",
        "text": "“I’ll go through the blue door, to Ores.”"
      },
      "editor": {
        "sortOrder": 0,
        "color": 0,
        "positionX": 11,
        "positionY": 11,
        "valid": [],
        "renderLabel": "Start"
      },
      "hash": "f32ac9015ae58ca58a5211a34131310a",
      "startBlock": true
    },
    {
      "blockId": "0b79333b-48c7-4576-b0e2-8fa03c5ce401",
      "content": "<p>Madame took a set of keys from her pocket. She knocked on the door and then opened it. Cora saw a spacious room with divans, luscious plants, and light curtains. A man and a woman waited in the room, clad in similar white outfits. They were both silver blonds with long, flowy hair. Victoria sat on the ground with her legs crossed. Victor lounged on a divan.</p>\n<p>&#x201C;Victor and Victoria, this is our dear guest, Cora,&#x201D; Madame said. Victoria got up and came straight to Cora. Without hesitation, she took Cora&#x2019;s hand, pulled her close, and kissed her lightly.</p>\n<p>&#x201C;Victor, come and take a look. She&#x2019;s lovely!&#x201D; she exclaimed. She glanced at Madame who gave an approving nod.</p>\n<p>Victor came to them, bowed to them both, and eyed Cora curiously. &#x201C;I can&#x2019;t wait to hear the sounds you make,&#x201D; he said with a smile.</p>\n<p>&#x201C;I&#x2019;ll leave Cora to enjoy your company,&#x201D; Madame said. The twins were already leading Cora to one of the divans. She didn&#x2019;t manage to say anything, only saw Victor bow to Madame as he closed the door.</p>\n<p>&#x201C;Stand there,&#x201D; Victoria said, her words not pushy but curious and happy, as they&#x2019;d received a new playmate. &#x201C;You are ours now. We&#x2019;ll take care of you.&#x201D;</p>\n<p>&#x201C;I want to undress her,&#x201D; Victor said. Their words were odd to Cora, as if they were talking about her, but not to her. At the same time, all their interest was on her. Victoria stroked her hair, and Victor placed his hands on the hem of her shirt and on her hips.</p>\n<p>Victor looked at her with a question in his eyes. Cora just nodded, and he pulled her shirt off.</p>\n<p>&#x201C;So beautiful,&#x201D; Victoria said. &#x201C;Victor, stand behind her.&#x201D; She kissed Cora again, lightly first, then with a demanding tongue. Victor&#x2019;s hands pulled Cora close to him, and she felt his lips on her neck. Victoria let her hands slide lower on her breasts.</p>\n<p>Cora tried to hold her sighs and moans back but very soon realized she didn&#x2019;t have to. And, finally, she couldn&#x2019;t. The twins&#x27; hands were all over her. Their kisses lit her on fire.</p>\n<p>&#x201C;I want her on the divan, on her back,&#x201D; Victoria said. Cora could feel her skin burn. She let Victor take her to the divan as Victoria sat on her knees on the end of the furniture. &#x201C;Here beautiful, on your back.&#x201D;</p>\n<p>Gently, but firmly, she opened Cora&#x2019;s legs. Her hands traveled up from Cora&#x2019;s ankles to her thighs. Cora longed for her to take it all the way, to touch her sex, but Victoria just winked at her. &#x201C;Victor, what would we do with her?&#x201D;</p>\n<p>Victor eyed Cora keenly and then looked at his sister. &#x201C;You could use your toys. And I would use my tongue.&#x201D;</p>\n<p>Victoria got excited. &#x201C;Or you, my dear brother, could use your hands, and I could use my tongue.&#x201D;</p>\n<p>Both of their eyes turned to Cora. While they were talking, their hands caressed her skin.</p>\n<p>&#x201C;You decide, Victoria,&#x201D; Victor said.</p>\n",
      "choseOne": {
        "target": "16b5e343-7c5b-416d-ad28-dfd8d93098de",
        "text": "“I’ll use my toys, and you use your tongue.”"
      },
      "choseTwo": {
        "target": "f5a53826-32a0-49e5-a600-78f555616fcb",
        "text": "“I’ll use my tongue, and you use your hands.”"
      },
      "editor": {
        "sortOrder": 1,
        "color": 1,
        "positionX": -7,
        "positionY": 23,
        "valid": [],
        "renderLabel": "1a"
      },
      "hash": "bd5dac2a902abba8ae481b76309ef30a",
      "startBlock": false
    },
    {
      "blockId": "16b5e343-7c5b-416d-ad28-dfd8d93098de",
      "content": "<p>&#x201C;I know just the right thing,&#x201D; Victoria said. &#x201C;Dear Victor, would you fetch the wooden one, in the gilded box?&#x201D;</p>\n<p>While Victor was away, Victoria continued to tease Cora. Her fingers almost touched Cora&#x27;s sex. Almost, but not quite.</p>\n<p>Victor handed his sister a box decorated with elaborate golden ornaments. While Victoria opened the box, Victor took Cora&#x2019;s hand and kissed her wrist, then used his tongue to tease the sensible skin.</p>\n<p>Victoria closed the box and lifted her choice for Cora to see. It was a dildo made of polished, dark wood.</p>\n<p>&#x201C;Victor, help me. Spread her lips,&#x201D; Victoria said. Cora sighed as she felt Victor&#x2019;s fingers gently touching her sex, and Victoria started to tease her with the dildo.</p>\n<p>When Victoria penetrated her with the dildo, she gasped. She then asked Victor to help her. As Victor&#x2019;s lips pressed against Cora&#x2019;s clitoris, she moaned.</p>\n",
      "choseOne": {
        "target": "c6b3f386-64e0-42ca-84eb-2e3623876616",
        "text": "Continue"
      },
      "choseTwo": {
        "target": "",
        "text": ""
      },
      "editor": {
        "sortOrder": 2,
        "color": 2,
        "positionX": -22,
        "positionY": 37,
        "valid": [],
        "renderLabel": "1a(1)"
      },
      "hash": "54f20e87e0a2d300b121aa70ec7d8a48",
      "startBlock": false
    },
    {
      "blockId": "f5a53826-32a0-49e5-a600-78f555616fcb",
      "content": "<p>Victoria looked Cora in the eyes. &#x201C;I can&#x2019;t wait to know what you taste like.&#x201D; She looked at her brother enthusiastically. &#x201C;What do you think she&#x2019;ll taste like?&#x201D;</p>\n<p>&#x201C;Something sweet. With a hint of spring. Strawberries,&#x201D; Victor said. &#x201C;Cora, dear, I need you to get up just a bit.&#x201D;</p>\n<p>Cora did, and Victor came to sit behind her and wrapped his arms around her. He caressed her breasts. His thumb was almost on her nipples, but not quite. Cora shivered with pleasure.</p>\n<p>Victoria spread her legs again and without hesitation, parted Cora&#x2019;s lips. She kissed and licked Cora&#x2019;s sex. Her tongue was hot and quick. Cora melted against Victor, and now his thumbs found her nipples.</p>\n<p>Cora couldn&#x2019;t help it. A little cry of pleasure escaped her lips. Victor made a pleased chuckle.</p>\n<p>When Victoria&#x2019;s lips pressed against her clitoris, she moaned.</p>\n",
      "choseOne": {
        "target": "c6b3f386-64e0-42ca-84eb-2e3623876616",
        "text": "Continue"
      },
      "choseTwo": {
        "target": "",
        "text": ""
      },
      "editor": {
        "sortOrder": 3,
        "color": 3,
        "positionX": 2,
        "positionY": 38,
        "valid": [],
        "renderLabel": "1a(2)"
      },
      "hash": "b217da35ccb46231d1775529a6739c75",
      "startBlock": false
    },
    {
      "blockId": "f52ea4a7-41c2-49f0-a1d7-77ff945a81c7",
      "content": "<p>Madame took a set of keys from her pocket. She knocked on the door and then opened it. A short man with gentle eyes bowed to them. He was dressed in loose pants and nothing else. Cora saw a large canopy bed and a small table surrounded with chairs. There wasn&#x2019;t anything else in the room. The light was dim.</p>\n<p>&#x201C;Ores, my friend. This is Cora,&#x201D; Madame said. She turned to Cora. &#x201C;I&#x2019;ll leave you in his capable hands,&#x201D; she said and closed the door.</p>\n<p>Cora didn&#x2019;t know what to say or do but, luckily, Ores didn&#x2019;t seem to care. When he spoke, he had a low, friendly voice. &#x201C;It&#x2019;s an honour to receive you in my chamber. Cora. .. Your name is as lovely as you are.&#x201D;</p>\n<p>He waited for her to reply and, when she didn&#x2019;t, he said it was okay if she didn&#x2019;t want to talk.</p>\n<p>&#x201C;I just don&#x2019;t know what to say,&#x201D; Cora confessed.</p>\n<p>&#x201C;Why don&#x2019;t you let your body do the talking?&#x201D; Ores said and took a good look at her. &#x201C;You seem tense. Perhaps we could start with a massage?&#x201D;</p>\n<p>&#x201C;Yes. .. yes, that sounds good.&#x201D;</p>\n<p>&#x201C;May I undress you?&#x201D; Ores asked and gestured to Cora to step closer to the bed.</p>\n<p>There was something soothing in his voice. Cora decided she was tired of hesitation and turned her back to Ores. &#x201C;Please do.&#x201D;</p>\n<p>Ores did. His hands were warm, gentle, and steady. He took his time, slid every garment off slowly and skillfully. When he was done, Ores opened the curtain of the bed and asked Cora to lie down on her stomach.</p>\n<p>&#x201C;I&#x2019;ll fetch the oil. And, Cora? It&#x2019;s okay to close your eyes.&#x201D;</p>\n<p>She did. A moment later, she felt the mattress move: Ores had come to the bed as well. She could hear him open the bottle. A sensual scent of lilies filled the bed. She wondered if he knew they were her favorite flowers. Her breath sharpened as Ores spread the oil over her neck.</p>\n<p>&#x201C;It&#x2019;s a little cold. But that&#x2019;s the point. To wake up your skin. Don&#x2019;t worry. My hands are warm,&#x201D; he said. He massaged her back, finding little knots in the muscles. She kept her eyes closed and started to relax.</p>\n<p>It didn&#x2019;t take long for her to start feeling something else. How good his hands felt on her skin. How his touch was sensual, becoming a caress. She no longer winced when he found a tense muscle, but started to breathe more deeply. Each breath was heavy with the scent of lilies.</p>\n<p>His hands stopped at her upper back. &#x201C;I&#x2019;ll work my way down now,&#x201D; he whispered. She felt the bed shift a little and sighed as he kissed her neck.</p>\n<p>Slowly, almost too slowly, he made his way down. He wasn&#x2019;t massaging her anymore. Somehow he was warming Cora up and turning her on. Sometimes he bent closer and kissed her skin, letting his warm breath tickle her. She remembered the talk about magic that they used at the pleasure house. Those who deemed it dangerous clearly knew nothing. This was just what Cora needed.</p>\n<p>Finally, his hands were on her buttocks. He didn&#x2019;t advance lower, just kept the motion going. Cora knew she had to say something.</p>\n<p>&#x201C;Please,&#x201D; she managed. She kept her eyes closed. Her hands clutched the satin sheets.</p>\n<p>&#x201C;Anything you want,&#x201D; Ores replied.</p>\n",
      "choseOne": {
        "target": "b4a49ff1-d36e-4ff5-a520-8c16683b1faf",
        "text": "“Fuck me from behind.”"
      },
      "choseTwo": {
        "target": "99a3cbde-e6c6-4606-b17d-e9f19e45e7d6",
        "text": "“I want to do it sideways.”"
      },
      "editor": {
        "sortOrder": 4,
        "color": 4,
        "positionX": 28,
        "positionY": 24,
        "valid": [],
        "renderLabel": "1b"
      },
      "hash": "7a12659550844d4616f863a64dd43d04",
      "startBlock": false
    },
    {
      "blockId": "b4a49ff1-d36e-4ff5-a520-8c16683b1faf",
      "content": "<p>&#x201C;Of course,&#x201D; Ores said. He took her by the hips and gently lifted her on her knees. She could hear him undo his loincloth. He put his hand on her lower back and, from there, let his fingers slide between her legs.</p>\n<p>&#x201C;Open your knees a little wider,&#x201D; he said. She did and gasped as she felt his fingers between her lips, caressing her gently and tentatively. She sighed with pleasure when he positioned his cock at her entrance and gasped when he entered her.</p>\n<p>When he started to caress her clitoris with his fingers, Cora moaned.</p>\n",
      "choseOne": {
        "target": "0867fe26-3ea8-47ad-bbef-cacab93dc420",
        "text": "Continue"
      },
      "choseTwo": {
        "target": "",
        "text": ""
      },
      "editor": {
        "sortOrder": 5,
        "color": 5,
        "positionX": 25,
        "positionY": 38,
        "valid": [],
        "renderLabel": "1b(1)"
      },
      "hash": "62a04f4d396d673eaf37f519f0564cb5",
      "startBlock": false
    },
    {
      "blockId": "99a3cbde-e6c6-4606-b17d-e9f19e45e7d6",
      "content": "<p>&#x201C;Of course,&#x201D; Ores said. She could hear him undo his loincloth. He came to lay behind her back. His body was warm and strong. He lifted her leg and positioned his cock at her entrance.</p>\n<p>&#x201C;Please, do it slowly,&#x201D; Cora said. She gasped when he entered her. His movements were unhurried and deep. Each thrust made Cora sigh with pleasure.</p>\n<p>But she needed more. Maybe Ores was still reading her body, because he whispered in her ear, &#x201C;Use your hand.&#x201D;</p>\n<p>Without hesitation, Cora put her hand between her lips and started to caress her clitoris. Ores picked up her rhythm and Cora started to moan.</p>\n",
      "choseOne": {
        "target": "0867fe26-3ea8-47ad-bbef-cacab93dc420",
        "text": "Continue"
      },
      "choseTwo": {
        "target": "",
        "text": ""
      },
      "editor": {
        "sortOrder": 6,
        "color": 6,
        "positionX": 49,
        "positionY": 39,
        "valid": [],
        "renderLabel": "1b(2)"
      },
      "hash": "dea4c21c1d06583d4743f0e365a8d202",
      "startBlock": false
    },
    {
      "blockId": "0867fe26-3ea8-47ad-bbef-cacab93dc420",
      "content": "<p>It didn&#x2019;t take long for her to finish. When she did, he held her close. Afterwards, they lay on the bed, Ores behind Cora. He asked if he could put his arm around her, and she said yes. The light was dim behind the bed curtains. His hand smelled of her and the lilies.</p>\n<p>&#x201C;Thank you,&#x201D; Cora said.</p>\n<p>&#x201C;No, thank you. You&#x2019;ve given me an honour to ignite your fire. Now, sweet Cora, do you want to rest? Maybe eat or drink something?&#x201D;</p>\n<p>His hand rested on her stomach. Cora took it and guided it to caress her breast. Ores knew what to do. He started to lazily make circles around her nipple.</p>\n<p>&#x201C;How soon can we do that again?&#x201D; Cora asked.</p>\n<p>He pulled her closer and kissed her neck. &#x201C;With you, sweet one, soon,&#x201D; Ores promised.</p>\n",
      "choseOne": {
        "target": "c6b3f386-64e0-42ca-84eb-2e3623876616",
        "text": "Continue"
      },
      "choseTwo": {
        "target": "",
        "text": ""
      },
      "editor": {
        "sortOrder": 7,
        "color": 7,
        "positionX": 24,
        "positionY": 78,
        "valid": [],
        "renderLabel": "1b(1)1"
      },
      "hash": "882b1504b5faaeb272559aaaf6a7c2d8",
      "startBlock": false
    },
    {
      "blockId": "c6b3f386-64e0-42ca-84eb-2e3623876616",
      "content": "<p>Afterwards, Micah led Cora to a luxurious bathroom. The bathwater was rich with flower petals and sweet oils. Micah asked Cora to step into the water. A little later, Madame herself entered the bathroom and asked if she could help Cora wash her back.</p>\n<p>&#x201C;Do you do this to every customer?&#x201D; Cora asked when Madame gently rubbed her back.</p>\n<p>&#x201C;Sometimes. When it&#x2019;s needed or when I want to take special care of our guests. Your skin is glowing-you&#x2019;re glowing. I hope you are satisfied with your visit?&#x201D;</p>\n<p>&#x201C;I am. More than happy.&#x201D; She wanted to ask if they&#x2019;d invite her again but didn&#x2019;t have the courage.</p>\n<p>As if she&#x2019;d read Cora&#x2019;s thoughts-Cora wouldn&#x2019;t be surprised if she had-Madame asked if Cora would honour them with her presence again. &#x201C;New doors, new companions? I feel like we&#x2019;ve only scratched the surface with you. And that your passion burns deep and strong.&#x201D;</p>\n<p>Cora thought of hands on her skin, the kisses and small bites. &#x201C;Yes,&#x201D; she whispered, and then again, more loudly, &#x201C;Yes, please.&#x201D;</p>\n",
      "choseOne": {
        "target": "",
        "text": ""
      },
      "choseTwo": {
        "target": "",
        "text": ""
      },
      "editor": {
        "sortOrder": 8,
        "color": 8,
        "positionX": 11,
        "positionY": 101,
        "valid": [],
        "renderLabel": "ending 1"
      },
      "hash": "e587856635e10d617f08e4838907a9ce",
      "startBlock": false
    }
  ]
}
